{"data": [{"Windows1": {"1": "<br>OS:</b>Windows 10 <br><br><b>Vulnerability Analysis: </b> <br>There are 11 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is High. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to another network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Medium impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group APT19(81.75).The second and third most similar groups are  Thrip(0.06) and admin@338(0.12). <br><br> <b>Next Attack:</b> Command and Scripting Interpreter will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 11 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: PARTIAL<br>integrityImpact: HIGH<br>availabilityImpact: PARTIAL<br>baseScore: 7.5<br>exploitabilityScore: 8.6<br>impactScore: 2.9<br>attackVector: NETWORK<br>attackComplexity: LOW<br>privilegesRequired: NONE<br>userInteraction: False<br>scope: UNCHANGED <br>baseSeverity: HIGH<br>", "3": 1, "4": 11, "5": 5, "6": 3}, "MacOS1": {"1": "<br>OS:</b>MacOS Sierra, 10.12.6 <br><br><b>Vulnerability Analysis: </b> <br>There are 36 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is Medium. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to Local network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Low impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group APT29(98.02).The second and third most similar groups are  RTM(0.01) and Dragonfly 2.0(0.01). <br><br> <b>Next Attack:</b> User Execution will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 36 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: COMPLETE<br>integrityImpact: PARTIAL<br>availabilityImpact: NONE<br>baseScore: 7.8<br>exploitabilityScore: 8.6<br>impactScore: 6.4<br>attackVector: LOCAL<br>attackComplexity: MEDIUM<br>privilegesRequired: LOW<br>userInteraction: REQUIRED<br>scope: UNCHANGED <br>baseSeverity: MEDIUM<br>", "3": 3, "4": 36, "5": 19, "6": 11}, "Linux1": {"1": "<br>OS:</b>Linux  <br><br><b>Vulnerability Analysis: </b> <br>There are 48 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is High. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to Local network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Low impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group menuPass(60.0).The second and third most similar groups are  APT1(0.1) and admin@338(0.3). <br><br> <b>Next Attack:</b> System Services will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 48 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: COMPLETE<br>integrityImpact: NONE<br>availabilityImpact: NONE<br>baseScore: 4.3<br>exploitabilityScore: 8.6<br>impactScore: 10.0<br>attackVector: LOCAL<br>attackComplexity: MEDIUM<br>privilegesRequired: False<br>userInteraction: REQUIRED<br>scope: UNCHANGED <br>baseSeverity: HIGH<br>", "3": 3, "4": 48, "5": 23, "6": 13}, "Windows2": {"1": "<br>OS:</b>Windows 10 <br><br><b>Vulnerability Analysis: </b> <br>There are 28 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is Critical. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to adjacent network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Medium impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group APT33(100.0).The second and third most similar groups are  menuPass(0.0) and Dark Caracal(0.0). <br><br> <b>Next Attack:</b> Exploitation for Client Execution will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 28 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: PARTIAL<br>integrityImpact: HIGH<br>availabilityImpact: PARTIAL<br>baseScore: 4.3<br>exploitabilityScore: 10.0<br>impactScore: 2.9<br>attackVector: ADJACENT_NETWORK<br>attackComplexity: LOW<br>privilegesRequired: LOW<br>userInteraction: False<br>scope: UNCHANGED <br>baseSeverity: CRITICAL<br>", "3": 2, "4": 28, "5": 11, "6": 6}, "Linux2": {"1": "<br>OS:</b>Linux  <br><br><b>Vulnerability Analysis: </b> <br>There are 48 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is High. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to another network. The exploitation can result in High level of data loss, have Low impact on confidential data and Medium impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group APT37(99.82).The second and third most similar groups are  The White Company(0.0) and APT41(0.0). <br><br> <b>Next Attack:</b> Command and Scripting Interpreter will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 48 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: NONE<br>integrityImpact: PARTIAL<br>availabilityImpact: PARTIAL<br>baseScore: 9.3<br>exploitabilityScore: 8.6<br>impactScore: 2.9<br>attackVector: NETWORK<br>attackComplexity: MEDIUM<br>privilegesRequired: NONE<br>userInteraction: REQUIRED<br>scope: UNCHANGED <br>baseSeverity: HIGH<br>", "3": 4, "4": 48, "5": 25, "6": 14}, "Linux3": {"1": "<br>OS:</b>Linux  <br><br><b>Vulnerability Analysis: </b> <br>There are 24 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is Medium. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to Local network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Medium impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group APT39(86.57).The second and third most similar groups are  Winnti Group(0.11) and APT41(0.02). <br><br> <b>Next Attack:</b> Command and Scripting Interpreter will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 24 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: PARTIAL<br>integrityImpact: COMPLETE<br>availabilityImpact: PARTIAL<br>baseScore: 4.3<br>exploitabilityScore: 8.6<br>impactScore: 10.0<br>attackVector: LOCAL<br>attackComplexity: MEDIUM<br>privilegesRequired: NONE<br>userInteraction: REQUIRED<br>scope: UNCHANGED <br>baseSeverity: MEDIUM<br>", "3": 2, "4": 24, "5": 11, "6": 7}, "MacOS2": {"1": "<br>OS:</b>MacOS Sierra, 10.12.6 <br><br><b>Vulnerability Analysis: </b> <br>There are 41 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is Medium. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to Local network. The exploitation can result in High level of data loss, have High impact on confidential data and High impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group OilRig(77.24).The second and third most similar groups are  GCMAN(0.0) and Thrip(0.23). <br><br> <b>Next Attack:</b> Scheduled Task/Job will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 41 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: HIGH<br>integrityImpact: COMPLETE<br>availabilityImpact: HIGH<br>baseScore: 7.2<br>exploitabilityScore: 8.6<br>impactScore: 2.9<br>attackVector: LOCAL<br>attackComplexity: HIGH<br>privilegesRequired: NONE<br>userInteraction: REQUIRED<br>scope: UNCHANGED <br>baseSeverity: MEDIUM<br>", "3": 3, "4": 41, "5": 19, "6": 11}, "Windows3": {"1": "<br>OS:</b>Windows 10 <br><br><b>Vulnerability Analysis: </b> <br>There are 42 unpatched vulnerabilities on this host. Of all the vulnerabilities, the highest level of severity is High. Some of the vulnerabilities here can still be exploited successfully in the future. If exploited, the impact will be limited to another network. The exploitation can result in High level of data loss, have Medium impact on confidential data and Medium impact on accessibility of the network.<br><br><b>Adversary:</b> The techniques used in the most recent attack is most similar to the ones used by cyber group menuPass(93.38).The second and third most similar groups are  RTM(0.05) and Soft Cell(0.01). <br><br> <b>Next Attack:</b> Windows Management Instrumentation will likely use the Scheduled Task/Job technique during the next attack. We are 76% confident about this assessment.<br><br> <b> Remediation: </b> <br> It will take 42 Person-Hours to address the vulnerabilities on this host. <br>", "2": "confidentialityImpact: PARTIAL<br>integrityImpact: HIGH<br>availabilityImpact: COMPLETE<br>baseScore: 7.2<br>exploitabilityScore: 10.0<br>impactScore: 6.4<br>attackVector: NETWORK<br>attackComplexity: LOW<br>privilegesRequired: LOW<br>userInteraction: False<br>scope: UNCHANGED <br>baseSeverity: HIGH<br>", "3": 3, "4": 42, "5": 23, "6": 13}}]}